export const craftSteps = [
  { id: 1, title: "选土", desc: "精选优质瓷土，细腻无杂质，可塑性强，含铁量低，以确保烧制出的瓷胎洁白细腻，釉色温润透亮。" },
  { id: 2, title: "揉泥", desc: "手工反复揉搓瓷土，排除气泡，使瓷土质地均匀、软硬适中，为后续拉坯打下基础。" },
  { id: 3, title: "拉坯", desc: "在高速旋转的轮盘上，匠人凭经验和手感拉出碗身、碗盖、碗托的雏形，讲究“心手合一”，确保坯体厚度、形状、比例精准无误。" },
  { id: 4, title: "修坯", desc: "用特制修坯刀细细修整坯体，削去多余泥料，使坯体厚度均匀、表面光滑，确保盖、碗、托三者扣合严丝合缝。" },
  { id: 5, title: "素烧", desc: "以800℃低温烘烤坯体，增加硬度，防止后续施釉、高温烧制时开裂。" },
  { id: 6, title: "上釉", desc: "采用“荡釉”工艺，使釉料均匀覆盖坯体内部和表面，确保釉层厚度均匀，光泽温润。" },
  { id: 7, title: "烧制", desc: "将施好釉的坯体放入高温窑炉，以1280℃至1300℃高温烧制12小时左右，使瓷土和釉料发生物理化学变化，形成坚硬、光滑、温润的瓷器。" },
  { id: 8, title: "彩绘/描金", desc: "在瓷器表面绘制纹样或勾勒金线，经二次低温烧制固定纹样，使三才碗更加精致华丽，更具观赏性。" }
];

export const patterns = [
  { id: 1, title: "竹纹", desc: "成都素有“竹城”之称，竹子不仅是成都人生活的一部分，更是其文化符号。三才碗上的竹纹简约线描，透着悠远意境，是成都三才碗上常见的纹样，与成都人内敛清雅的性子相得益彰。" },
  { id: 2, title: "芙蓉纹", desc: "芙蓉花是成都市花，象征美丽、坚韧与繁荣。碗上的芙蓉纹盛放娇美，花瓣层次丰富，颜色过渡自然，既显芙蓉之美，寓意着美丽、坚韧与繁荣。它不仅是成都这座城市的魅力象征，也是三才碗上经典纹样。" },
  { id: 3, title: "熊猫纹", desc: "作为“熊猫之都”，熊猫早已成为成都的名片。三才碗上的熊猫纹或卡通可爱或写实生动，色彩鲜艳格外讨喜。它不仅是一件饮茶器具，更成为了成都的旅游纪念品，带着成都的文化走向世界。" },
  { id: 4, title: "青花缠枝纹", desc: "青花缠枝纹是中国传统瓷器中的经典纹样之一，在成都三才碗上也有着悠久的历史。缠缠绕绕的纹样寓意着生生不息、富贵绵长；青蓝色的青花与洁白的瓷底相映成趣，显得格外雅致。" }
];

export const secrets = [
  { id: "A", title: "茶盖朝下靠茶托", desc: "将碗盖斜放在碗口边缘，露出一半碗口，这是在告诉茶博士“请续水”。当茶客喝完碗中的茶，想要继续饮用时，只需将碗盖斜放，茶博士便会主动前来续水，无需开口催促。" },
  { id: "B", title: "茶盖上放点小东西", desc: "将碗盖倒扣在碗身之上，这是在告诉茶博士“只是暂时离开，请勿收走盖碗”。茶客临时起身去洗手间、买东西或与人交谈时，将碗盖倒扣，茶博士就会知道这碗茶还有人喝，不会将碗收走，体现了茶馆的贴心与人性化。" },
  { id: "C", title: "碗盖立起放茶碗旁", desc: "将碗盖立着插在碗托和茶碗之间，这是在告诉茶博士“钱没带够，要赊账”。这一般都是老熟客才会这样做，现在科技发达大都是扫码结账，这个暗语也就用的很少了。" },
  { id: "D", title: "盖朝上放进茶碗", desc: "将碗盖翻转放进茶碗里，这是在告诉茶博士“已经喝完了，可以收走了”。当茶客准备离开时，将碗盖放平，茶博士便会前来收拾桌子，简洁高效，无需多余的语言交流。" },
  { id: "E", title: "盖碗朝上平放", desc: "将碗盖反转放在茶碗旁边，这是在告诉茶博士“需要帮助”。当茶客遇到问题或是麻烦时，会向茶博士寻求帮助，大多是外地人需要帮助，问问厕所或是小卖部。" }
];
